OpenFOAM/foam9tutorials/CFD/flameSpread_parallelPanels/0/alphaSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphaSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type        zeroGradient;
    }

    outlet
    {
        type        zeroGradient;
    }

    sides
    {
        type        zeroGradient;
    }

    burner
    {
        type        zeroGradient;
    }

    "(region0_to.*)"
    {
        type        alphaSgsFireWallFunction; 
        QcFlame     18000;
        QcThreshold 1000;
        value       uniform 0;
    }
}

// ************************************************************************* //
