OpenFOAM/foam9tutorials/CFD/flameSpread_parallelPanels/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    sides
    {
        type            patch;
        nFaces          3200;
        startFace       1058728;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       1061928;
    }
    region0_to_panelRegion_panel_bottom
    {
        type            mappedWall;
        nFaces          18432;
        startFace       1062328;
        sampleMode      nearestPatchFace;
        sampleRegion    panelRegion;
        samplePatch     region0_to_panelRegion_panel_bottom;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
18432
(
(2.77555756156e-17 -6.93889390391e-18 0)
(2.77555756156e-17 -8.67361737988e-19 5.55111512313e-17)
(2.77555756156e-17 0 0)
(5.55111512313e-17 -8.67361737988e-19 5.55111512313e-17)
(-2.77555756156e-17 -2.77555756156e-17 0)
(0 -2.77555756156e-17 5.55111512313e-17)
(0 2.77555756156e-17 -5.55111512313e-17)
(0 -1.38777878078e-17 0)
...
)
;
    }
    ground
    {
        type            patch;
        nFaces          20452;
        startFace       1080760;
    }
    burner
    {
        type            patch;
        nFaces          1152;
        startFace       1101212;
    }
)

// ************************************************************************* //
